/*
输入两个正整数 m 和 n，求其 最大公约数 和 最小公倍数。
最大公约数：
m = 319, n = 377
k = m % n = 319 ->58
m = n, n = k --循环到上一步--↑
*/
#include <stdio.h>
int main()
{
    int m, n, m0, n0, k, y, b; // k=余数 y=公约数 b=倍数
    m0 = m = 98;
    n0 = n = 37;
    do
    {
        k = m % n;
        m = n;
        n = k;
    } while (k != 0); // k != 0 时继续循环，k = 0 时退出循环
    y = m;
    b = m0 * n0 / y;
    printf("最大公约数 y 是 %d\n", y);
    printf("最小公倍数 b 是 %d\n", b);
    return 0;
}
/*
最大公约数：辗转相除法：
输入 98 37：
98 % 37 = 24
37 % 24 = 13
24 % 13 = 11
13 % 11 = 2
11 % 2  = 1
2  % 1  = 0
最小公倍数：3626

输入 100 40：
最大公约数：20
最小公倍数：200
*/