/*
有一个分数序列
2   3   5   8   13   21
- , - , - , - , -- , -- , ...
1   2   3   5    8   13
求出这个数列的前20项之和。
规律：
1 , 2 , 3 ： 3 是前两个数之和，之后都是前两个数之和，只有前两个数需要给定。
n0 = 1
n1 = 2
        n1
s = s + --   <--(1)
        n0
t = n1
n1 = n0 + n1 //新 n1 等于原来 n0 + n1
n0 = t  -->(1)
*/
#include <stdio.h>
int main()
{
    double n0, n1, t;
    double s;
    s = 0;
    n0 = 1;
    n1 = 2;
    for (int i = 0; i < 20; i++)
    {
        s += n1 / n0;
        t = n1;
        n1 += n0;
        n0 = t;
    }
    printf("s =%16.10f\n", s);
    return 0;
}
// s =   32.6602607986