/*
*/
#include <stdio.h>
int main()
{
    /*
    定义方式：
    类型符 数组名[常量表达式]
    命名规则和变量名相同
    引用方式：
    数组名[下标]

    例：对10个数组依次赋值为0,1,2,3,4,5,6,7,8,9，要求按逆序输出
    定义一个长度为10的数组，数组定义为整形
    要赋的值是从0到9，可以用循环来赋值
    用循环按下标从大到小输出这10个元素
    */
    int array[10];
    // array[0] = 0; array[1] = 1; array[2] = 2; ...
    int i;
    for (i = 0; i < 10; i++)
        array[i] = i;
    for (i = 9; i >= 0; i--)
        printf("%d", array[i]); // 9876543210
    printf("\n");
    for (i = 0; i < 10; i++)
        printf("%d", array[i]); // 0123456789
    printf("\n");
    /*
    在定义数组的同时，给各数组元素赋值
    */
    int a[10] = {0, 1, 2, 3, 4, 5, 6, 7, 8, 9};
    int a[10] = {0, 1, 2, 3, 4}; //相当于：
    int a[10] = {0, 1, 2, 3, 4, 0, 0, 0, 0, 0};
    int a[10] = {0, 0, 0, 0, 0, 0, 0, 0, 0, 0}; //相当于：
    int a[10] = {0};
    return 0;
}