/*
通常计算每一位的数字的算法是：
个位: a = 123 % 10 = 3
十位: b = 123 % 100 / 10 = 2
百位: c = 123 % 100 = 2

首先定义变量  j = 123
m = 0

第一步：求出个位上的数字
m = j % 10 = 123 % 10 = 3
j = j / 10 =  123 / 10 = 12; //将三位数变成两位数

第二步：求出十位上的数字
m = j % 10 = 12 % 10 = 2
j = j / 10 = 12 / 10 = 1 //将两位数变成一位数

第三步：求出百位上的数字
m = j % 10 = 1 % 10 = 1
j = j / 10 = 1 / 10 = 0 //将数字清零

最后得到个位上的数字是3，十位上的数字是2， 百位上的数字是1
*/

#include <stdio.h>
#include <stdlib.h>
void main()
{
	int num;
	int i = 0;
	printf("请输入一个数字:");
	scanf("%d", &num);
	while(num>0)
	{
		i = num % 10;      // 计算每一位上的数字
		printf("%d\n", i); // 打印每一位数字
		num = num / 10;    // 实现位与位之间的遍历
	}
	system("pause");
}

// https://blog.csdn.net/u010105970/article/details/25958279